## Provision plan

Terraform will perform the following actions:

  # module.aws.aws_s3_bucket_lifecycle_configuration.hrm_export_expiry will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "hrm_export_expiry" {
      + bucket = "tl-aselo-docs-th-production"
      + id     = (known after apply)

      + rule {
          + id     = "HRM Exported Data Expiration Policy"
          + status = "Enabled"

          + expiration {
              + days                         = 30
              + expired_object_delete_marker = (known after apply)
            }

          + filter {
              + prefix = "hrm-data/"
            }
        }
    }

  # module.aws.aws_s3_bucket_ownership_controls.chat will be created
  + resource "aws_s3_bucket_ownership_controls" "chat" {
      + bucket = "tl-public-chat-th-prod"
      + id     = (known after apply)

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # module.aws.aws_s3_bucket_ownership_controls.docs will be created
  + resource "aws_s3_bucket_ownership_controls" "docs" {
      + bucket = "tl-aselo-docs-th-production"
      + id     = (known after apply)

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # module.aws.aws_ssm_parameter.aws_region will be created
  + resource "aws_ssm_parameter" "aws_region" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - account SID by short helpline"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/production/aws/AC77e853192a62159196decc2468243518/region"
      + tags           = {
          + "Environment" = "production"
          + "Name"        = "/production/aws/AC77e853192a62159196decc2468243518/region"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "production"
          + "Name"        = "/production/aws/AC77e853192a62159196decc2468243518/region"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.main_group["CHAT_WORKFLOW_SID"] must be replaced
-/+ resource "aws_ssm_parameter" "main_group" {
      ~ arn            = "arn:aws:ssm:us-east-1:712893914485:parameter/PROD_TWILIO_TH_CHAT_WORKFLOW_SID" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ description    = "Twilio account - Chat transfer workflow SID" -> (known after apply)
      ~ id             = "PROD_TWILIO_TH_CHAT_WORKFLOW_SID" -> (known after apply)
      + insecure_value = (known after apply)
      ~ key_id         = "alias/aws/ssm" -> (known after apply)
      ~ name           = "PROD_TWILIO_TH_CHAT_WORKFLOW_SID" # forces replacement -> (known after apply) # forces replacement
      - tags           = {} -> null
      ~ tags_all       = {} -> (known after apply)
      ~ tier           = "Standard" -> (known after apply)
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["POST_SURVEY_BOT_CHAT_URL"] will be created
  + resource "aws_ssm_parameter" "main_group" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = (sensitive value)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = (sensitive value)
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.main_group["SURVEY_WORKFLOW_SID"] must be replaced
-/+ resource "aws_ssm_parameter" "main_group" {
      ~ arn            = "arn:aws:ssm:us-east-1:712893914485:parameter/PROD_TWILIO_TH_SURVEY_WORKFLOW_SID" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ description    = "Twilio account - Survey Workflow SID" -> (known after apply)
      ~ id             = "PROD_TWILIO_TH_SURVEY_WORKFLOW_SID" -> (known after apply)
      + insecure_value = (known after apply)
      ~ key_id         = "alias/aws/ssm" -> (known after apply)
      ~ name           = "PROD_TWILIO_TH_SURVEY_WORKFLOW_SID" # forces replacement -> (known after apply) # forces replacement
      - tags           = {} -> null
      ~ tags_all       = {} -> (known after apply)
      ~ tier           = "Standard" -> (known after apply)
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.aws.aws_ssm_parameter.twilio_chat_workflow_sid will be updated in-place
  ~ resource "aws_ssm_parameter" "twilio_chat_workflow_sid" {
        id             = "/production/twilio/AC77e853192a62159196decc2468243518/chat_workflow_sid"
      + insecure_value = (known after apply)
        name           = "/production/twilio/AC77e853192a62159196decc2468243518/chat_workflow_sid"
        tags           = {
            "Environment" = "production"
            "Name"        = "/production/twilio/AC77e853192a62159196decc2468243518/chat_workflow_sid"
            "Terraform"   = "true"
        }
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.twilio_post_survey_bot_chat_url[0] will be created
  + resource "aws_ssm_parameter" "twilio_post_survey_bot_chat_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - Post Survey Bot Chat URL"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/production/twilio/AC77e853192a62159196decc2468243518/post_survey_bot_chat_url"
      + tags           = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/AC77e853192a62159196decc2468243518/post_survey_bot_chat_url"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "production"
          + "Name"        = "/production/twilio/AC77e853192a62159196decc2468243518/post_survey_bot_chat_url"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.twilio_survey_workflow_sid will be updated in-place
  ~ resource "aws_ssm_parameter" "twilio_survey_workflow_sid" {
        id             = "/production/twilio/AC77e853192a62159196decc2468243518/survey_workflow_sid"
      + insecure_value = (known after apply)
        name           = "/production/twilio/AC77e853192a62159196decc2468243518/survey_workflow_sid"
        tags           = {
            "Environment" = "production"
            "Name"        = "/production/twilio/AC77e853192a62159196decc2468243518/survey_workflow_sid"
            "Terraform"   = "true"
        }
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws_monitoring.aws_cloudwatch_metric_alarm.alarm_twilio_email will be destroyed
  # (because aws_cloudwatch_metric_alarm.alarm_twilio_email is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "alarm_twilio_email" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:us-east-1:712893914485:AWS-production-alarms",
        ] -> null
      - alarm_description         = "Childline Thailand (Production) received at least 1 Twilio errors in the past hour. Sent email notification." -> null
      - alarm_name                = "production-twilio-reporter-th-email" -> null
      - arn                       = "arn:aws:cloudwatch:us-east-1:712893914485:alarm:production-twilio-reporter-th-email" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 1 -> null
      - dimensions                = {
          - "Name"  = "Account"
          - "Value" = "TH_PRODUCTION"
        } -> null
      - evaluation_periods        = 1 -> null
      - id                        = "production-twilio-reporter-th-email" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "PRODUCTION ERROR x ACCOUNT" -> null
      - namespace                 = "Twilio Reporter" -> null
      - ok_actions                = [] -> null
      - period                    = 3600 -> null
      - statistic                 = "Sum" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 1 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_channels_v1.task_channel["survey"] will be created
  + resource "twilio_taskrouter_workspaces_task_channels_v1" "task_channel" {
      + channel_optimized_routing = (known after apply)
      + friendly_name             = "Survey"
      + id                        = (known after apply)
      + sid                       = (known after apply)
      + unique_name               = "survey"
      + workspace_sid             = "WS52f1c6a440f61a5d6075f5f3aeb351bf"
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_queues_v1.task_queue["e2e_test"] will be created
  + resource "twilio_taskrouter_workspaces_task_queues_v1" "task_queue" {
      + assignment_activity_sid  = (known after apply)
      + friendly_name            = "E2E Test Queue"
      + id                       = (known after apply)
      + max_reserved_workers     = (known after apply)
      + reservation_activity_sid = (known after apply)
      + sid                      = (known after apply)
      + target_workers           = "email=='aselo-alerts+production@techmatters.org'"
      + task_order               = (known after apply)
      + workspace_sid            = "WS52f1c6a440f61a5d6075f5f3aeb351bf"
    }

  # module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.workflow["master"] will be updated in-place
  ~ resource "twilio_taskrouter_workspaces_workflows_v1" "workflow" {
      ~ configuration            = jsonencode(
            {
              - task_routing = {
                  - filters = [
                      - {
                          - expression           = "channelType IN [\"web\",\"twitter\",\"instagram\",\"line\"]  OR isContactlessTask == true OR  twilioNumber IN ['messenger:59591583805', 'twitter:1154628838472597505', 'instagram:59591583805', 'line:U65333e6b8ca9e96e41252ecb27c44cf9']"
                          - filter_friendly_name = "Childline Thailand"
                          - targets              = [
                              - {
                                  - expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  - queue      = "WQc1783ea233b86159b221f6e384e82285"
                                },
                            ]
                        },
                    ]
                }
            }
        ) -> (known after apply)
        id                       = "WS52f1c6a440f61a5d6075f5f3aeb351bf/WW3d4eff0e8595f4506363dcff91946d15"
        # (4 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.workflow["survey"] will be updated in-place
  ~ resource "twilio_taskrouter_workspaces_workflows_v1" "workflow" {
      ~ configuration            = jsonencode(
          ~ {
              ~ task_routing = {
                  ~ filters = [
                      ~ {
                          ~ expression           = "isSurveyTask==true" -> "isChatCaptureControl==true"
                          ~ filter_friendly_name = "Survey Filter" -> "CaptureChannel"
                          ~ targets              = [
                              ~ {
                                  - expression = "isSurveyTask==true"
                                    # (1 unchanged attribute hidden)
                                },
                            ]
                        },
                    ]
                }
            }
        )
      ~ friendly_name            = "Survey" -> "Survey Workflow"
        id                       = "WS52f1c6a440f61a5d6075f5f3aeb351bf/WW073bdfe856c4345e1569db2125aac654"
        # (3 unchanged attributes hidden)
    }

Plan: 10 to add, 4 to change, 3 to destroy.
